/*Дано слово. Вывести на экран его третий символ.
*/
public class P8task9_13 {
	public static void main(String[] args) {
		String word = "Hello, JIHC!";
		char c2 = word.charAt(2);
	
		System.out.println("Char : "+c2);
	}
}